[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:61:34
                     isInvalid={Boolean(errors.itemId)}
                     {...register("itemId", {
                         required: "Item Id is required.",
-                        pattern: {
-                            value: int_rgx,
-                            message: "Item Id must be a number"
-                        },
+                        pattern: {},
                     })}
                 />
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Item Id must be a number/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:63:38
                         required: "Item Id is required.",
                         pattern: {
                             value: int_rgx,
-                            message: "Item Id must be a number"
+                            message: ""
                         },
                     })}
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Item Id must be a number/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:80:35
                     type="text"
                     isInvalid={Boolean(errors.reviewerEmail)}
                     {...register("reviewerEmail", {
-                        required: "Reviewer Email is required.",
+                        required: "",
                         pattern: {
                             value: email_rgx,
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Reviewer Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:81:34
                     isInvalid={Boolean(errors.reviewerEmail)}
                     {...register("reviewerEmail", {
                         required: "Reviewer Email is required.",
-                        pattern: {
-                            value: email_rgx,
-                            message: "Reviewer Email must be a valid email address"
-                        },
+                        pattern: {},
                     })}
                 />
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Reviewer Email must be a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:83:38
                         required: "Reviewer Email is required.",
                         pattern: {
                             value: email_rgx,
-                            message: "Reviewer Email must be a valid email address"
+                            message: ""
                         },
                     })}
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Reviewer Email must be a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:100:35
                     type="text"
                     isInvalid={Boolean(errors.stars)}
                     {...register("stars", {
-                        required: "Stars are required.",
+                        required: "",
                         pattern: {
                             value: stars_rgx,
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars are required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:115:49
             <Form.Group className="mb-3" >
                 <Form.Label htmlFor="date-reviewed">Date Reviewed</Form.Label>
                 <Form.Control
-                    data-testid={testIdPrefix + "-date-reviewed"}
+                    data-testid={testIdPrefix + ""}
                     id="date-reviewed"
                     type="text"
killedBy: MenuItemReviewForm tests No Error messsages on good input
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewForm-date-reviewed"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:119:50
                     id="date-reviewed"
                     type="text"
                     isInvalid={Boolean(errors.dateReviewed)}
-                    {...register("dateReviewed", {
-                        required: "Date Reviewed is required.",
-                        pattern: {
-                            value: isodate_rgx,
-                            message: "Date Reviewed must be a valid date"
-                        },
-                    })}
+                    {...register("dateReviewed", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Reviewed is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:121:34
                     isInvalid={Boolean(errors.dateReviewed)}
                     {...register("dateReviewed", {
                         required: "Date Reviewed is required.",
-                        pattern: {
-                            value: isodate_rgx,
-                            message: "Date Reviewed must be a valid date"
-                        },
+                        pattern: {},
                     })}
                 />
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Reviewed must be a valid date/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
