[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:3:59
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function RecommendationRequestCreatePage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function RecommendationRequestCreatePage() {}
 
killedBy: RecommendationRequestCreatePage tests Renders expected content
statusReason: Error: RecommendationRequestCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
