[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestEditPage.js:3:57
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function RecommendationRequestEditPage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Edit page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function RecommendationRequestEditPage() {}
 
killedBy: RecommendationRequestEditPage tests Renders expected content
statusReason: Error: RecommendationRequestEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
